<?php
/**
 * cgyio/spf 框架 异常处理类
 * 
 * 框架 Orm 模块 异常处理
 * 归属于 框架内部模块异常
 * 具体的应用类，如果要自定义异常处理，应继承此类
 */

namespace Spf\module\orm;

use Spf\exception\BaseException;

class OrmException extends BaseException 
{
    /**
     * 当前类型的 异常处理类 异常代码 code 前缀
     * spf 框架内部异常 code 前缀区间 000~099
     * 应用层自定义异常 code 前缀区间 100~999
     * !! 覆盖父类的静态属性
     */
    protected static $codePrefix = 30;   //相当于 030
    //异常码(不带前缀) 的 位数，0 为 不指定位数
    protected static $codeDigit = 4;

    /**
     * 当前类型的 异常处理类 中定义的 异常信息
     * 主要针对 框架内部核心类的 异常信息
     * 
     * !! 覆盖父类的静态属性
     * !! 应定义多语言
     */
    protected static $exceptions = [
        //zh-CN
        "zh-CN" => [

            //Orm 数据库类异常 0300000 ~ 0300019
            "orm"  => [
                //初始化失败 0300000
                "initialize"    => ["Orm 模块初始化失败", "可能的原因：%{1}%", 0],  //code = 0300000
                //未指定有效数据库 异常 0300001
                "nodb"          => ["未指定有效的数据库", "未能在 ORM 参数中找到有效的数据库定义", 1],  //code = 0300001
                //数据库类实例化失败 0300002
                "instance"      => ["数据库实例创建失败", "无法创建数据库 %{1}% 的实例，可能的原因：%{2}%", 2],  //code = 0300002
                //数据库配置解析失败 0300003
                "config"        => ["数据库配置参数解析失败", "无法解析数据库 %{1}% 的配置参数，可能的原因：%{2}%",  3],     //code = 0300003
                //数据模型配置参数解析失败 0300004
                "parse"         => ["无法解析数据模型配置参数", "无法解析数据模型 %{1}% 的配置参数，可能的原因：%{2}%",  4],     //code = 0200004
            ],

            //Db 数据库操作异常 0300020 ~ 0300029
            "db" => [
                //连接失败 0300020
                "connect"       => ["数据库连接失败", "无法连接数据库 %{1}%，可能的原因：%{2}%", 20],
                //建库失败 0300021
                "create"        => ["创建数据库失败", "无法创建数据库 %{1}%，可能的原因：%{2}%", 21],
                //备份失败 0300022
                "backup"        => ["备份数据库失败", "无法备份数据库 %{1}%，可能的原因：%{2}%", 22],
                //备份失败 0300023
                "restore"       => ["恢复数据库失败", "无法恢复数据库 %{1}%，可能的原因：%{2}%", 23],
                //建表失败 0300024
                "create_table"  => ["创建数据表失败", "无法创建数据表 %{1}%/%{2}%，可能的原因：%{3}%", 24],

                //trans 事务失败 0300029
                "trans"         => ["执行事务操作失败", "针对 %{1}% 数据库执行事务操作失败，可能的原因：%{2}%", 29],
            ],

            //Curd 操作异常 0300030 ~ 0300049
            "curd" => [
                //curd 初始化失败 0300030
                "initialize"    => ["无法开始 CURD", "数据表 %{1}% 无法开始 CURD 操作，可能的原因：%{2}%", 30],
                //reset 失败 0300031
                "reset"         => ["无法重置 CURD", "数据表 %{1}% 无法重置 CURD 操作，可能的原因：%{2}%", 31],
                //column|join|whereParser 解析参数失败 0300032
                "parse"         => ["无法解析 CURD 参数", "数据表 %{1}% %{2}% 解析参数失败，可能的原因：%{3}%", 32],

                //执行 medoo 操作失败 0300039
                "medoo"         => ["无法执行 CURD 操作", "数据表 %{1}% 无法执行 %{2}% 操作，可能的原因：%{3}%", 39],
            ],
            
            
            
            //...

        ],
    ];
    


    /**
     * 判断当前异常是否需要终止响应
     * !! 子类必须覆盖此方法，实现不同类型异常的 退出 判断
     * @return Bool
     */
    public function needExit()
    {
        //!! 所有 Orm 模块异常 都必须终止响应
        return true;
    }
}